<?php

use yii\db\Migration;

/**
 * Class m210612_172037_add_new_cities
 */
class m210612_172037_add_new_cities extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->batchInsert('crm_project.cities', ['name','country_id'], [
            ['Киев',1],
            ['Харьков',1],
            ['Одесса',1],
            ['Днепр',1],
            ['Донецк',1],
            ['Запорожье',1],
            ['Львов',1],
            ['Кривой Рог',1],
            ['Николаев',1],
            ['Севастополь',1],
            ['Мариуполь',1],
            ['Луганск',1],
            ['Винница',1],
            ['Симферополь',1],
            ['Макеевка',1],
            ['Херсон',1],
            ['Чернигов',1],
            ['Полтава',1],
            ['Черкассы',1],
            ['Хмельницкий',1],
            ['Черновцы',1],
            ['Житомир',1],
            ['Сумы',1],
            ['Ровно',1],
            ['Горловка',1],
            ['Ивано-Франковск',1],
            ['Каменское',1],
            ['Кропивницкий',1],
            ['Тернополь',1],
            ['Кременчуг',1],
            ['Луцк',1],
            ['Белая Церковь',1],
            ['Краматорск',1],
            ['Мелитополь',1],
            ['Керчь',1],
            ['Ужгород',1],
            ['Бердянск',1],
            ['Никополь',1],
            ['Славянск',1],
            ['Евпатория',1],
            ['Бровары',1],
            ['Алчевск',1],
            ['Павлоград',1],
            ['Северодонецк',1],
        ]);
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        return false;
    }
}
